In [33]:
# data cleaning and plots
import pandas as pd
import numpy as np

In [34]:
# Load data
initial_data = pd.read_csv('../../datasets/liver/indian_liver_patient.csv')

In [35]:
initial_data.head()

,Age,Gender,Total_Bilirubin,Direct_Bilirubin,Alkaline_Phosphotase,Alamine_Aminotransferase,Aspartate_Aminotransferase,Total_Protiens,Albumin,Albumin_and_Globulin_Ratio,Dataset
0,65,Female,0.7,0.1,187,16,18,6.8,3.3,0.90,2
1,62,Male,10.9,5.5,699,64,100,7.5,3.2,0.74,2
2,62,Male,7.3,4.1,490,60,68,7.0,3.3,0.89,2
3,58,Male,1.0,0.4,182,14,20,6.8,3.4,1.00,2
4,72,Male,3.9,2.0,195,27,59,7.3,2.4,0.40,2

In [36]:
initial_data = initial_data.sort_values('Dataset')
initial_data.head()

,Age,Gender,Total_Bilirubin,Direct_Bilirubin,Alkaline_Phosphotase,Alamine_Aminotransferase,Aspartate_Aminotransferase,Total_Protiens,Albumin,Albumin_and_Globulin_Ratio,Dataset
291,60,Male,0.7,0.2,174,32,14,7.8,4.2,1.1,1
281,50,Male,0.7,0.2,192,18,15,7.4,4.2,1.3,1
283,18,Male,1.3,0.7,316,10,21,6.0,2.1,0.5,1
287,43,Male,1.3,0.6,155,15,20,8.0,4.0,1.0,1
293,23,Male,1.1,0.5,191,37,41,7.7,4.3,1.2,1

In [37]:
initial_data['Dataset'].value_counts()

2    416
1    167
Name: Dataset, dtype: int64

In [38]:
initial_data = initial_data.iloc[:-(416-167)]

In [39]:
initial_data['Dataset'].value_counts()

2    167
1    167
Name: Dataset, dtype: int64

In [40]:
initial_data.to_csv('../../datasets/liver/indian_liver_patient_balanced.csv', index=False)